### 문제 1번

In [61]:
url='https://docs.google.com/spreadsheets/d/1fiioUPMRurfE523yWGaRF3ckO-TUHu1AaIAI6Eo7Ti8/export?format=csv'
pd.read_csv(url)

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

### 문제 2번

In [ ]:
import pandas as pd
titles=pd.read_csv('titles.csv')

In [66]:
titles.shape

(215981, 2)

## pd 기본
    pd.head()
    pd.columns
    pd.info
    pd.tail()
    pd.shape

In [69]:
titles.info()   #데이터 유형 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [76]:
titles.isnull().sum().sum()   #전체 널값

0

In [78]:
titles['year'].describe()   #요약통계량

count    215981.000000
mean       1984.553822
std          29.343957
min        1894.000000
25%        1965.000000
50%        1994.000000
75%        2010.000000
max        2024.000000
Name: year, dtype: float64

In [67]:
titles.head(5)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

### 문제 3번

In [79]:
titles    #w전체영화는 215981개

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [81]:
titles.shape

(215981, 2)

### 문제 4번

In [5]:
title_first_2=titles.sort_values(by='year').head(2)
title_first_2

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [15]:
title_first_2=title_first_2.rename(columns={'index':'id'})

In [16]:
title_first_2

   level_0      id                                              title  year
0        0  165182                                         Miss Jerry  1894
1        1   85708  Reproduction of the Corbett and Fitzsimmons Fight  1897

In [18]:
title_first_2.drop('level_0',axis=1)

       id                                              title  year
0  165182                                         Miss Jerry  1894
1   85708  Reproduction of the Corbett and Fitzsimmons Fight  1897

### 문제 5번

In [19]:
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [82]:
titles_hamlet=titles[titles['title']=='Hamlet']
titles_hamlet.reset_index(drop=True)   #19개

     title  year
0   Hamlet  1948
1   Hamlet  2016
2   Hamlet  2015
3   Hamlet  1990
4   Hamlet  1910
5   Hamlet  1954
6   Hamlet  1976
7   Hamlet  1987
8   Hamlet  2000
9   Hamlet  1921
10  Hamlet  1969
11  Hamlet  1913
12  Hamlet  2009
13  Hamlet  1964
14  Hamlet  1996
15  Hamlet  2011
16  Hamlet  1911
17  Hamlet  1973
18  Hamlet  2014

In [22]:
len(titles_hamlet)

19

### 문제6번

In [27]:
titles_treasure_island=titles[titles['title']=='Treasure Island']
titles_treasure_island

                  title  year
47769   Treasure Island  1920
90175   Treasure Island  1950
103646  Treasure Island  1973
104714  Treasure Island  1972
166675  Treasure Island  1999
190792  Treasure Island  1985
191379  Treasure Island  1918
192917  Treasure Island  1934

In [28]:
len(titles_treasure_island)

8

In [34]:
titles_treasure_island=titles_treasure_island.sort_values(by='year')

In [35]:
titles_treasure_island

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

### 문제 7번

In [36]:
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [39]:
titels_1950_1959=titles[(titles['year']>=1950)&(titles['year']<=1959)]

In [40]:
titels_1950_1959

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
106                             Qiu yu can hua  1953
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[12120 rows x 2 columns]

In [43]:
titels_1950_1959=titels_1950_1959.sort_values('year')

In [44]:
titels_1950_1959

                             title  year
169853   Wer fuhr den grauen Ford?  1950
68891          Mark of the Gorilla  1950
111631       Lo sparviero del Nilo  1950
144763             Lockende Gefahr  1950
200615                 Tacos joven  1950
...                            ...   ...
182675                 Speed Crazy  1959
33077                Piet se Tante  1959
33096   Unser Wunderland bei Nacht  1959
136480                Up Periscope  1959
107566                  The Rookie  1959

[12120 rows x 2 columns]

In [58]:
len(titels_1950_1959)

12120

In [59]:
titels_1950_1959.reset_index(drop=True)

                            title  year
0       Wer fuhr den grauen Ford?  1950
1             Mark of the Gorilla  1950
2           Lo sparviero del Nilo  1950
3                 Lockende Gefahr  1950
4                     Tacos joven  1950
...                           ...   ...
12115                 Speed Crazy  1959
12116               Piet se Tante  1959
12117  Unser Wunderland bei Nacht  1959
12118                Up Periscope  1959
12119                  The Rookie  1959

[12120 rows x 2 columns]